{"/blog/":{"data":{"":" RSS Feed "},"title":"Blog"},"/documentation/":{"data":{"":"","next#Next":"Dive right into the following section to get started:\nGetting StartedLearn how to create website using Hextra ","questions-or-feedback#Questions or Feedback?":" ❓ Hextra is still in active development. Have a question or feedback? Feel free to open an issue! "},"title":"Documentation"},"/documentation/getting-started/":{"data":{"":"","quick-start-from-template#Quick Start from Template":" "},"title":"Getting Started"},"/introduction/":{"data":{"":"","history#History":"Initially conceptualized in Summer of 2024 by then SY students of the Astro Club, the project started out as a simple idea with only one vision. It was meant to be a simple database that would contain folders containing official documents, images and code of official projects undertaken by the students. A simple idea to solve one problem the club faced. To store data in one place so that it can be easily found and time and effort wasted in looking for it can be saved. The team of SYs working on this database didn’t just stop there though, they evolved the idea to be something more meaningful and useful. They added some more functionality to it by finding new tools and creatively implementing them in the the project so that multiple problems can be solved on the go. Eventually after an year an official department was created in June of 2025 to manage all the operations related to data and insights of the club called the Resources Team, inducted in 2025.\nThe idea was simple, to identify a problem and find or create a solution for the problem. To solve all the problems the club faced like - loss of crucial knowledge, information and know-hows, inefficiency, lack of transparency and accountability, we use Free and Open Source Software (FOSS) or free versions of mainstream applications by which we were able to keep the cost of this whole project to zero.\nThere are four major pillars of the Resources Team: Repository Workspace Website Community × Lets now understand these four sub departments of the Resources team better in the upcoming doc.\nNext The Resources DepartmentLearn more about the Resources Team and its 4 subsections! "},"title":"Documentation"},"/introduction/resources-team/":{"data":{"":"","#":" Next The Resources DepartmentLearn more about the Resources Team and its 4 subsections! Previous The Resources DepartmentLearn more about the Resources Team and its 4 subsections! "},"title":"Resources Team"},"/introduction/the-resources-dept/":{"data":{"":"","#":" Next The Resources DepartmentLearn more about the Resources Team and its 4 subsections! Previous Introduction to the Repository Project "},"title":"The Resources Department"}}